Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроверитьПередачуВКонтекстПриведенногоКСтрокеЗначения");
	юТест = ЮнитТестирование;
	
	Возврат ВсеТесты;
	
КонецФункции

Процедура ТестДолжен_ПроверитьПередачуВКонтекстПриведенногоКСтрокеЗначения() Экспорт
    ТекстКласса =
    	"Процедура ОбработкаПолученияПредставления(Представление, СтандартнаяОбработка)
    	|	СтандартнаяОбработка = Ложь;
    	|	Представление = ""Представление"";
    	|КонецПроцедуры";
    	
    КлассИзСтроки = ЗагрузитьСценарийИзСтроки(ТекстКласса);
    
    // see https://github.com/EvilBeaver/OneScript/issues/1530
    // СтрНайти это подключаемый контекст, который вызывается маршаллером.
    
    юТест.ПроверитьРавенство(1, СтрНайти(КлассИзСтроки, "Представление"), Строка(КлассИзСтроки));
    
КонецПроцедуры